# -*- mode: org; org-export-babel-evaluate: nil -*-
#+TITLE: Rprofile
#+AUTHOR: Bingwei TIAN
#+EMAIL: bwtian@gmail.com
#+DATE: [2014-09-19 Fri]
#+OPTIONS: H:4 toc:2 num:2 email:t
#+STARTUP: align fold nodlcheck hidestars oddeven lognotestate inlineimages 
#+CREATED:  [2013-05-01 Wed 22:15]
#+LICENSE: GPLv3
#+TODO:    TODO(t!) FIXIT(f!) DOING(d!) | DONE(o!) SOMEDAY(s!)
#+PROPERTY:   header-args:R  session *R*
#+PROPERTY:   cache yes
#+PROPERTY:   tangle yes
#+DEPENDENCY: run C-c C-v t
#+DESCRIPTION: This document is both for my .Rrofile setting  and
               A Rprofile package to make my .Profile portable without Dropbox. 
** DONE Linux
#+NAME: sh:setRprofileLinux
#+BEGIN_SRC sh  :tangle ~/Dropbox/config/R/rProfile/setRprofileLinux.sh
# Now=$(date +%Y-%m-%d-%H%M%S)
# cp ~/.Rprofile ~/.Rprofile.$Now
unalias ln
ln -sfv ~/Dropbox/config/R/rProfile/R00_Linux_dot_Rprofile.R  ~/.Rprofile
#+END_SRC

#+RESULTS[9bd12cf0c5ab3d8b711828ab5fb06ae476d84ee8]: sh:setRprofileLinux
: ‘/home/tian/.Rprofile’ -> ‘/home/tian/Dropbox/config/R/rProfile/R00_Linux_dot_Rprofile.R’

